---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyNewTypeWarn
source: html/c4b24f13-6690-e69d-41da-bbd7aa95aa43.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyNewTypeWarn Property

Edits to these assemblies match existing type and will inherit that name.

## Syntax (C#)
```csharp
public static FailureDefinitionId AssemblyNewTypeWarn { get; }
```